Revit 2027 API
BuiltInFailures.SketchFailures.SculptingCurvesCrossAxis Property
 The highlighted curves cross the axis.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId SculptingCurvesCrossAxis { get; }
Public Shared ReadOnly Property SculptingCurvesCrossAxis As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ SculptingCurvesCrossAxis {
	FailureDefinitionId^ get ();
}
static member SculptingCurvesCrossAxis : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.SketchFailures Class
Autodesk.Revit.DB Namespace